// Задача 64: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. 
// Выполнить с помощью рекурсии.

// Console.WriteLine("Введите натуральное число больше 1:");
// int number = Convert.ToInt32(Console.ReadLine());

// void NumberCounter (int number)
// {
//     if (number < 0) Console.Write($"{number} не натуральное число");
//     if (number == 0) return;
//     Console.Write("{0,4}", number);
//     NumberCounter (number - 1);
// }

// NumberCounter(number);


// Задача 66: Задайте значения M и N. Напишите программу, которая найдёт 
//сумму натуральных элементов в промежутке от M до N.

// M = 1; N = 15 -> 120
// M = 4; N = 8. -> 30

// Console.WriteLine("Введите первое натуральное число больше нуля: ");
// int n=Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите второе натуральное число больше нуля: ");
// int m=Convert.ToInt32(Console.ReadLine());
// static int SumNumbers(int n, int m)
// {
//     if (n==m) return n; 
//     if (n<m)
//     {
//         return m+SumNumbers(n,m - 1);
//     }
//     else return m+SumNumbers(n,m + 1);
    
// }

// Console.Write( SumNumbers( n,m));
// Console.ReadLine();


// Задача 68: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.
// m = 2, n = 3 -> A(m,n) = 9
// m = 3, n = 2 -> A(m,n) = 29

Console.Write("Введите число M: ");
int m = Convert.ToInt32(Console.ReadLine());

Console.Write("Введите число N: ");
int n = Convert.ToInt32(Console.ReadLine());

AkkermanFunction(m,n);

void AkkermanFunction(int m, int n)
{
    Console.Write(Akkerman(m, n)); 
}

int Akkerman(int m, int n)
{
    if (m == 0)
    {
        return n + 1;
    }
    else if (n == 0 && m > 0)
    {
        return Akkerman(m - 1, 1);
    }
    else
    {
        return (Akkerman(m - 1, Akkerman(m, n - 1)));
    }
}
